{
  "blogPosts": [
    {
      "id": 1,
      "title": "Senirkent MYO'da Yeni Dönem Başladı",
      "slug": "senirkent-myoda-yeni-donem-basladi",
      "excerpt": "2023-2024 Eğitim-Öğretim yılında Senirkent MYO'da yeni dönem heyecanla başladı. Detaylar için okuyun.",
      "content": "<p>Senirkent Meslek Yüksekokulu'nda 2023-2024 Eğitim-Öğretim yılı, düzenlenen açılış töreniyle başladı. Törene, Isparta Uygulamalı Bilimler Üniversitesi Rektörü Prof. Dr. İbrahim Diler, Senirkent Kaymakamı Özgür Özdemir, Senirkent Belediye Başkanı Doç. Dr. Levent Ergin, öğretim elemanları ve öğrenciler katıldı.</p><p>Senirkent MYO Müdürü Dr. Öğr. Üyesi Mehmet Akif Öncü, açılış konuşmasında yeni dönemde yapılacak projelerden bahsetti ve tüm öğrencilere başarılar diledi. Rektör Prof. Dr. İbrahim Diler ise konuşmasında, üniversitede uygulama odaklı eğitimin önemine değindi ve öğrencilere tavsiyelerde bulundu.</p><p>Yeni dönemde Bilgisayar Programcılığı, İşletme Yönetimi, Bankacılık ve Sigortacılık, Büro Yönetimi ve Yönetici Asistanlığı programlarında eğitim verilecek olup, öğrencilere yönelik sosyal ve kültürel etkinlikler de planlandı.</p>",
      "author": "Admin",
      "date": "2023-09-25",
      "image": "img/blog/okul-acilis.jpg",
      "views": 124,
      "tags": ["Duyurular", "Etkinlikler"]
    },
    {
      "id": 2,
      "title": "Senirkent MYO Öğrencilerinden Kariyer Günleri Etkinliği",
      "slug": "senirkent-myo-ogrencilerinden-kariyer-gunleri-etkinligi",
      "excerpt": "Senirkent MYO öğrencileri, düzenledikleri Kariyer Günleri etkinliğinde sektör temsilcileriyle buluştu.",
      "content": "<p>Senirkent Meslek Yüksekokulu öğrencileri tarafından organize edilen 'Kariyer Günleri' etkinliği büyük ilgi gördü. İki gün süren etkinlikte, farklı sektörlerden temsilciler öğrencilerle bir araya geldi.</p><p>Etkinliğin ilk gününde bankacılık ve finans sektöründen yöneticiler sunum yaparken, ikinci gün yazılım ve bilişim firmaları deneyimlerini paylaştı. Öğrenciler, mezuniyet sonrası iş imkanları hakkında bilgi edinme ve sektör profesyonelleriyle networking yapma fırsatı buldular.</p><p>Etkinliğin kapanışında konuşan Senirkent MYO Müdürü Dr. Öğr. Üyesi Mehmet Akif Öncü, bu tür organizasyonların öğrencilerin kariyer planlamasına katkı sağladığını belirterek, emeği geçen herkese teşekkür etti.</p>",
      "author": "Ayşe Yılmaz",
      "date": "2023-11-10",
      "image": "img/blog/kariyer-gunleri.jpg",
      "views": 87,
      "tags": ["Etkinlikler", "Kariyer"]
    },
    {
      "id": 3,
      "title": "Bilişim Sektöründe Yeni Trendler Paneli Düzenlendi",
      "slug": "bilisim-sektorunde-yeni-trendler-paneli-duzenlendi",
      "excerpt": "Senirkent MYO'da bilişim sektöründeki yeni teknolojiler ve kariyer fırsatları hakkında panel düzenlendi.",
      "content": "<p>Senirkent Meslek Yüksekokulu Bilgisayar Programcılığı bölümü tarafından 'Bilişim Sektöründe Yeni Trendler ve Kariyer Fırsatları' konulu panel düzenlendi. Panele konuşmacı olarak yazılım sektöründen üst düzey yöneticiler katıldı.</p><p>Yapay zeka, bulut bilişim, siber güvenlik gibi alanlardaki gelişmelerin tartışıldığı panelde, öğrencilere sektördeki kariyer fırsatları hakkında da bilgiler verildi. Konuşmacılar özellikle yazılım geliştirme, veri analizi ve siber güvenlik alanlarında kalifiye elemanlara olan ihtiyacın arttığını vurguladılar.</p><p>Etkinlik sonunda öğrenciler, konuşmacılara merak ettikleri soruları sorma imkanı buldular. Panel, katılımcılara sertifika takdimi ile sona erdi.</p>",
      "author": "Mehmet Demir",
      "date": "2023-12-05",
      "image": "img/blog/bilisim-panel.jpg",
      "views": 65,
      "tags": ["Teknoloji", "Eğitim", "Kariyer"]
    },
    {
      "id": 4,
      "title": "Mezunlarımızın Başarı Hikayeleri",
      "slug": "mezunlarimizin-basari-hikayeleri",
      "excerpt": "Senirkent MYO mezunlarının iş hayatındaki başarıları ve kariyer yolculukları.",
      "content": "<p>Senirkent Meslek Yüksekokulu'ndan mezun olan öğrencilerimizin iş hayatındaki başarıları ve kariyer yolculuklarını içeren bir dizi röportaj gerçekleştirdik. Farklı sektörlerde çalışan mezunlarımız, eğitim hayatlarından iş dünyasına geçiş süreçlerini ve kariyerlerindeki önemli anları bizlerle paylaştılar.</p><p>2018 mezunlarımızdan Ali Yıldız, şu anda uluslararası bir yazılım firmasında ekip lideri olarak görev yapıyor. Yıldız, MYO'da aldığı pratik eğitimin iş hayatında kendisine büyük avantaj sağladığını belirtti. 2019 mezunu Zeynep Kaya ise kendi dijital pazarlama ajansını kurma başarısı gösterdi.</p><p>Mezunlarımızın hikayeleri, halihazırda öğrenim gören öğrencilerimiz için ilham kaynağı olurken, MYO eğitiminin değerini de ortaya koyuyor. Başarı hikayelerinin tamamına 'Mezunlar' sayfamızdan ulaşabilirsiniz.</p>",
      "author": "Özge Can",
      "date": "2024-01-20",
      "image": "img/blog/mezun-basari.jpg",
      "views": 92,
      "tags": ["Mezunlar", "Kariyer", "Başarı Hikayeleri"]
    },
    {
      "id": 5,
      "title": "Dijital Pazarlama Atölyesi Başlıyor",
      "slug": "dijital-pazarlama-atolyesi-basliyor",
      "excerpt": "Senirkent MYO'da öğrencilere yönelik ücretsiz Dijital Pazarlama Atölyesi programı başlıyor.",
      "content": "<p>Senirkent Meslek Yüksekokulu'nda öğrencilere yönelik ücretsiz 'Dijital Pazarlama Atölyesi' programı başlıyor. İşletme Yönetimi programı öğretim elemanları tarafından yürütülecek olan atölye çalışmaları, tüm bölümlerden öğrencilere açık olacak.</p><p>6 hafta sürecek programda; sosyal medya yönetimi, içerik pazarlama, SEO, Google Ads, e-mail pazarlama ve analitik gibi konular ele alınacak. Atölyeye katılan öğrenciler, gerçek projeler üzerinde çalışma imkanı bulacak ve program sonunda sertifika almaya hak kazanacaklar.</p><p>Kontenjanın sınırlı olduğu programa başvurmak isteyen öğrenciler, 1-10 Şubat tarihleri arasında öğrenci işlerinden alacakları formu doldurarak başvurularını yapabilirler.</p>",
      "author": "Hasan Kara",
      "date": "2024-02-01",
      "image": "img/blog/dijital-pazarlama.jpg",
      "views": 45,
      "tags": ["Eğitim", "Dijital Pazarlama", "Etkinlikler"]
    },
    {
      "id": 6,
      "title": "Öğrenci Kulüpleri Tanıtım Günü",
      "slug": "ogrenci-kulupleri-tanitim-gunu",
      "excerpt": "Senirkent MYO'daki öğrenci kulüpleri, düzenlenen tanıtım gününde faaliyetlerini ve projelerini anlattılar.",
      "content": "<p>Senirkent Meslek Yüksekokulu'nda faaliyet gösteren öğrenci kulüpleri, düzenlenen 'Kulüp Tanıtım Günü' etkinliğinde bir araya geldi. MYO bahçesinde kurulan stantlarda kulüpler, faaliyetlerini ve projelerini tanıttılar.</p><p>Teknoloji, İşletme, Gönüllülük, Spor, Sanat ve Müzik alanlarında faaliyet gösteren toplam 8 kulüp, yeni dönemde gerçekleştirecekleri etkinlikler hakkında bilgi verirken, öğrencilerin kulüplere üyelik başvurularını da kabul ettiler.</p><p>MYO Müdür Yardımcısı Dr. Öğr. Üyesi Ayşe Demir, öğrenci kulüplerinin akademik eğitimi sosyal faaliyetlerle desteklediğini belirterek, tüm öğrencileri ilgi alanlarına göre en az bir kulübe üye olmaya davet etti.</p>",
      "author": "Emre Yılmaz",
      "date": "2023-10-15",
      "image": "img/blog/kulup-tanitim.jpg",
      "views": 53,
      "tags": ["Öğrenci Kulüpleri", "Sosyal Aktiviteler"]
    }
  ]
}
